In [1]:
%load_ext sql

In [2]:
%sql sqlite:///publications.db

'Connected: @publications.db'

In [3]:
%%sql
SELECT *
FROM sqlite_master
limit 5

 * sqlite:///publications.db
Done.

[('table', 'authors', 'authors', 2, 'CREATE TABLE `authors` (\n  `au_id` varchar(11) NOT NULL\n,  `au_lname` varchar(40) NOT NULL\n,  `au_fname` varchar(20) NOT NULL\n,  `phone` char(12) ... (60 characters truncated) ... varchar(20) DEFAULT NULL\n,  `state` char(2) DEFAULT NULL\n,  `zip` char(5) DEFAULT NULL\n,  `contract` integer NOT NULL\n,  PRIMARY KEY (`au_id`)\n)'),
 ('index', 'sqlite_autoindex_authors_1', 'authors', 3, None),
 ('table', 'discounts', 'discounts', 4, 'CREATE TABLE `discounts` (\n  `discounttype` varchar(40) NOT NULL\n,  `stor_id` char(4) DEFAULT NULL\n,  `lowqty` integer DEFAULT NULL\n,  `highqty`  ... (37 characters truncated) ... ecimal(4,2) NOT NULL\n,  CONSTRAINT `discounts_ibfk_1` FOREIGN KEY (`stor_id`) REFERENCES `stores` (`stor_id`) ON DELETE CASCADE ON UPDATE CASCADE\n)'),
 ('table', 'employee', 'employee', 5, 'CREATE TABLE `employee` (\n  `emp_id` char(9) NOT NULL\n,  `fname` varchar(20) NOT NULL\n,  `minit` char(1) DEFAULT NULL\n,  `lname` varchar(30) NOT  ... (262 characters truncated) ... E ON UPDATE CASCADE\n,  CONSTRAINT `employee_ibfk_2` FOREIGN KEY (`pub_id`) REFERENCES `publishers` (`pub_id`) ON DELETE CASCADE ON UPDATE CASCADE\n)'),
 ('index', 'sqlite_autoindex_employee_1', 'employee', 6, None)]

In [4]:
%%sql
SELECT tbl_name
FROM sqlite_master
WHERE type='table'

 * sqlite:///publications.db
Done.

[('authors',),
 ('discounts',),
 ('employee',),
 ('jobs',),
 ('pub_info',),
 ('publishers',),
 ('roysched',),
 ('sales',),
 ('stores',),
 ('titleauthor',),
 ('titles',)]

# Challenge 1 - Who Have Published What At Where?

In this challenge you will write a `SELECT` query that joins various tables to figure out what titles each author has published at which publishers. Your output should have at least the following columns:

* `AUTHOR_ID` - the ID of the author
* `LAST_NAME` - author last name
* `FIRST_NAME` - author first name
* `TITLE` - name of the published title
* `PUBLISHER` - name of the publisher where the title was published

In [5]:
%%sql
CREATE TABLE table_1 as
SELECT au.au_id as AUTHOR_ID,
       au.au_lname as LAST_NAME,
       au.au_fname as FIRST_NAME,
       t.title as TITLE,
       p.pub_name as PUBLISHER 
FROM authors au
     inner join titleauthor tau on au.au_id = tau.au_id
     inner join titles t on t.title_id = tau.title_id
     inner join publishers p on p.pub_id = t.pub_id
ORDER BY au.au_id

 * sqlite:///publications.db
Done.

[]

In [6]:
%%sql
SELECT *
FROM table_1
limit 10

 * sqlite:///publications.db
Done.

[('172-32-1176', 'White', 'Johnson', 'Prolonged Data Deprivation: Four Case Studies', 'New Moon Books'),
 ('213-46-8915', 'Green', 'Marjorie', "The Busy Executive's Database Guide", 'Algodata Infosystems'),
 ('213-46-8915', 'Green', 'Marjorie', 'You Can Combat Computer Stress!', 'New Moon Books'),
 ('238-95-7766', 'Carson', 'Cheryl', 'But Is It User Friendly?', 'Algodata Infosystems'),
 ('267-41-2394', "O'Leary", 'Michael', 'Cooking with Computers: Surreptitious Balance Sheets', 'Algodata Infosystems'),
 ('267-41-2394', "O'Leary", 'Michael', 'Sushi, Anyone?', 'Binnet & Hardley'),
 ('274-80-9391', 'Straight', 'Dean', 'Straight Talk About Computers', 'Algodata Infosystems'),
 ('409-56-7008', 'Bennet', 'Abraham', "The Busy Executive's Database Guide", 'Algodata Infosystems'),
 ('427-17-2319', 'Dull', 'Ann', 'Secrets of Silicon Valley', 'Algodata Infosystems'),
 ('472-27-2349', 'Gringlesby', 'Burt', 'Sushi, Anyone?', 'Binnet & Hardley')]

If your query is correct, the total rows in your output should be the same as the total number of records in Table `titleauthor`.

In [7]:
%%sql
SELECT count(*)
FROM titleauthor

 * sqlite:///publications.db
Done.

[(25,)]

In [8]:
%%sql
SELECT count(*)
FROM table_1

 * sqlite:///publications.db
Done.

[(25,)]

# Challenge 2 - Who Have Published How Many At Where?
Elevating from your solution in Challenge 1, query how many titles each author has published at each publisher.

In [9]:
%%sql
CREATE TABLE table_2 as
SELECT AUTHOR_ID,
       LAST_NAME,
       FIRST_NAME,
       PUBLISHER,
       count(TITLE) as TITLE_COUNT
FROM table_1
GROUP BY AUTHOR_ID

 * sqlite:///publications.db
Done.

[]

In [10]:
%%sql
SELECT *
FROM table_2

 * sqlite:///publications.db
Done.

[('172-32-1176', 'White', 'Johnson', 'New Moon Books', 1),
 ('213-46-8915', 'Green', 'Marjorie', 'Algodata Infosystems', 2),
 ('238-95-7766', 'Carson', 'Cheryl', 'Algodata Infosystems', 1),
 ('267-41-2394', "O'Leary", 'Michael', 'Algodata Infosystems', 2),
 ('274-80-9391', 'Straight', 'Dean', 'Algodata Infosystems', 1),
 ('409-56-7008', 'Bennet', 'Abraham', 'Algodata Infosystems', 1),
 ('427-17-2319', 'Dull', 'Ann', 'Algodata Infosystems', 1),
 ('472-27-2349', 'Gringlesby', 'Burt', 'Binnet & Hardley', 1),
 ('486-29-1786', 'Locksley', 'Charlene', 'Algodata Infosystems', 2),
 ('648-92-1872', 'Blotchet-Halls', 'Reginald', 'Binnet & Hardley', 1),
 ('672-71-3249', 'Yokomoto', 'Akiko', 'Binnet & Hardley', 1),
 ('712-45-1867', 'del Castillo', 'Innes', 'Binnet & Hardley', 1),
 ('722-51-5454', 'DeFrance', 'Michel', 'Binnet & Hardley', 1),
 ('724-80-9391', 'MacFeather', 'Stearns', 'Algodata Infosystems', 2),
 ('756-30-7391', 'Karsen', 'Livia', 'Binnet & Hardley', 1),
 ('807-91-6654', 'Panteley', 'Sylvia', 'Binnet & Hardley', 1),
 ('846-92-7186', 'Hunter', 'Sheryl', 'Algodata Infosystems', 1),
 ('899-46-2035', 'Ringer', 'Anne', 'Binnet & Hardley', 2),
 ('998-72-3567', 'Ringer', 'Albert', 'New Moon Books', 2)]

To check if your output is correct, sum up the `TITLE COUNT` column. The sum number should be the same as the total number of records in Table `titleauthor`.

In [11]:
%%sql
SELECT count(*)
FROM titleauthor

 * sqlite:///publications.db
Done.

[(25,)]

In [12]:
%%sql
SELECT sum(TITLE_COUNT)
FROM table_2

 * sqlite:///publications.db
Done.

[(25,)]

# Challenge 3 - Best Selling Authors

Who are the top 3 authors who have sold the highest number of titles? Write a query to find out.

Requirements:

* Your output should have the following columns:
	* `AUTHOR_ID` - the ID of the author
	* `LAST_NAME` - author last name
	* `FIRST_NAME` - author first name
	* `TOTAL` - total number of titles sold from this author
* Your output should be ordered based on `TOTAL` from high to low.
* Only output the top 3 best selling authors.

*Hint: In order to calculate the total of profits of an author, you need to use the [SUM function](https://cloud.google.com/bigquery/docs/reference/standard-sql/aggregate_functions#sum). Refer to the reference and learn how to use it.*

In [13]:
%%sql
CREATE TABLE table_3 as
SELECT au.au_id as AUTHOR_ID,
       au.au_lname as LAST_NAME,
       au.au_fname as FIRST_NAME,
       sum(s.qty) as TOTAL
FROM authors au
     inner join titleauthor tau on au.au_id = tau.au_id
     inner join titles t on t.title_id = tau.title_id
     inner join sales s on s.title_id = t.title_id
GROUP BY AUTHOR_ID
ORDER BY TOTAL desc

 * sqlite:///publications.db
Done.

[]

In [14]:
%%sql
SELECT *
FROM table_3
limit 3

 * sqlite:///publications.db
Done.

[('899-46-2035', 'Ringer', 'Anne', 148),
 ('998-72-3567', 'Ringer', 'Albert', 133),
 ('213-46-8915', 'Green', 'Marjorie', 50)]

# Challenge 4 - Best Selling Authors Ranking

Now modify your solution in Challenge 3 so that the output will display all 23 authors instead of the top 3. Note that the authors who have sold 0 titles should also appear in your output (ideally display `0` instead of `NULL` as the `TOTAL`). Also order your results based on `TOTAL` from high to low.

In [15]:
%%sql
CREATE TABLE table_4 as
SELECT au.au_id as AUTHOR_ID,
       au.au_lname as LAST_NAME,
       au.au_fname as FIRST_NAME,
       coalesce(sum(s.qty), 0) as TOTAL
FROM authors au
     left join titleauthor tau on au.au_id = tau.au_id
     left join titles t on t.title_id = tau.title_id
     left join sales s on s.title_id = t.title_id
GROUP BY AUTHOR_ID
ORDER BY TOTAL desc

 * sqlite:///publications.db
Done.

[]

In [16]:
%%sql
SELECT *
FROM table_4

 * sqlite:///publications.db
Done.

[('899-46-2035', 'Ringer', 'Anne', 148),
 ('998-72-3567', 'Ringer', 'Albert', 133),
 ('213-46-8915', 'Green', 'Marjorie', 50),
 ('427-17-2319', 'Dull', 'Ann', 50),
 ('846-92-7186', 'Hunter', 'Sheryl', 50),
 ('267-41-2394', "O'Leary", 'Michael', 45),
 ('724-80-9391', 'MacFeather', 'Stearns', 45),
 ('722-51-5454', 'DeFrance', 'Michel', 40),
 ('807-91-6654', 'Panteley', 'Sylvia', 40),
 ('238-95-7766', 'Carson', 'Cheryl', 30),
 ('486-29-1786', 'Locksley', 'Charlene', 25),
 ('472-27-2349', 'Gringlesby', 'Burt', 20),
 ('648-92-1872', 'Blotchet-Halls', 'Reginald', 20),
 ('672-71-3249', 'Yokomoto', 'Akiko', 20),
 ('756-30-7391', 'Karsen', 'Livia', 20),
 ('172-32-1176', 'White', 'Johnson', 15),
 ('274-80-9391', 'Straight', 'Dean', 15),
 ('409-56-7008', 'Bennet', 'Abraham', 15),
 ('712-45-1867', 'del Castillo', 'Innes', 10),
 ('341-22-1782', 'Smith', 'Meander', 0),
 ('527-72-3246', 'Greene', 'Morningstar', 0),
 ('724-08-9931', 'Stringer', 'Dirk', 0),
 ('893-72-1158', 'McBadden', 'Heather', 0)]

# Bonus Challenge - Most Profiting Authors

Authors earn money from their book sales in two ways: advance and royalties. An advance is the money that the publisher pays the author before the book comes out. The royalties the author will receive is typically a percentage of the entire book sales. The total profit an author receives by publishing a book is the sum of the advance and the royalties.

Given the information above, who are the 3 most profiting authors and how much royalties each of them have received? Write a query to find out.

Requirements:

* Your output should have the following columns:
	* `AUTHOR_ID` - the ID of the author
	* `LAST_NAME` - author last name
	* `FIRST_NAME` - author first name
	* `PROFIT` - total profit the author has received combining the advance and royalties
* Your output should be ordered from higher `PROFIT` values to lower values.
* Only output the top 3 most profiting authors.

*Hints:* 

* If a title has multiple authors, how they split the royalties can be found in the `royaltyper` column of the `titleauthor` table.
* We assume the coauthors will split the advance in the same way as the royalties.

In [17]:
%%sql
CREATE TABLE table_bonus as
SELECT au.au_id as AUTHOR_ID,
       au.au_lname as LAST_NAME,
       au.au_fname as FIRST_NAME,
       coalesce((t.advance + round(coalesce(t.price * s.qty * t.royalty / 100 * tau.royaltyper / 100, 0), 2)),0) as PROFIT
FROM authors au
     left join titleauthor tau on au.au_id = tau.au_id
     left join titles t on t.title_id = tau.title_id
     left join sales s on s.title_id = t.title_id
GROUP BY AUTHOR_ID
ORDER BY PROFIT desc

 * sqlite:///publications.db
Done.

[]

In [18]:
%%sql
SELECT *
FROM table_bonus
limit 3

 * sqlite:///publications.db
Done.

[('722-51-5454', 'DeFrance', 'Michel', 15013.46),
 ('899-46-2035', 'Ringer', 'Anne', 15004.49),
 ('427-17-2319', 'Dull', 'Ann', 8050.0)]